andysworkshop/stm32plus/stm32plus/src/dma/f4/interrupts/Dma1Stream6InterruptHandler.cpp
/*
 * This file is a part of the open source stm32plus library.
 * Copyright (c) 2011,2012,2013 Andy Brown <www.andybrown.me.uk>
 * Please see website for licensing terms.
 */

#include "config/stm32plus.h"
#include "config/dma.h"


// this is only for the F4

#ifdef STM32PLUS_F4

using namespace stm32plus;


// static initialisers for the hack that forces the IRQ handlers to be linked

template<> DmaInterruptFeatureEnabler<1,6>::FPTR DmaInterruptFeatureEnabler<1,6>::_forceLinkage=nullptr;


extern "C" {

  /**
   * DMA1, stream 6
   */

  #if defined(USE_DMA1_6_INTERRUPT)
    void __attribute__ ((interrupt("IRQ"))) DMA1_Stream6_IRQHandler() {

      if(DMA_GetITStatus(DMA1_Stream6,DMA_IT_TCIF6)!=RESET) {
        DmaInterruptFeature<1,6>::_dmaInstance->notifyObservers(ObservableEvent::DMA_TransferComplete,(void *)0x00010006);
        DMA_ClearITPendingBit(DMA1_Stream6,DMA_IT_TCIF6);
      }
      else if(DMA_GetITStatus(DMA1_Stream6,DMA_IT_HTIF6)!=RESET) {
        DmaInterruptFeature<1,6>::_dmaInstance->notifyObservers(ObservableEvent::DMA_HalfTransfer,(void *)0x00010006);
        DMA_ClearITPendingBit(DMA1_Stream6,DMA_IT_HTIF6);
      }
      else if(DMA_GetITStatus(DMA1_Stream6,DMA_IT_TEIF6)!=RESET) {
        DmaInterruptFeature<1,6>::_dmaInstance->notifyObservers(ObservableEvent::DMA_TransferError,(void *)0x00010006);
        DMA_ClearITPendingBit(DMA1_Stream6,DMA_IT_TEIF6);
      }
    }
  #endif
}
#endif // STM32PLUS_F4
